/* automatically generated by rust-bindgen 0.71.1 */
#![allow(non_camel_case_types, non_snake_case, non_upper_case_globals)]

#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _POABool {
    #[doc = "< false"]
    POA_FALSE = 0,
    #[doc = "< true"]
    POA_TRUE = 1,
}
pub use self::_POABool as POABool;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _POABayerPattern {
    #[doc = "< RGGB"]
    POA_BAYER_RG = 0,
    #[doc = "< BGGR"]
    POA_BAYER_BG = 1,
    #[doc = "< GRBG"]
    POA_BAYER_GR = 2,
    #[doc = "< GBRG"]
    POA_BAYER_GB = 3,
    #[doc = "< Monochrome, the mono camera with this"]
    POA_BAYER_MONO = -1,
}
pub use self::_POABayerPattern as POABayerPattern;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _POAImgFormat {
    #[doc = "< 8bit raw data, 1 pixel 1 byte, value range[0, 255]"]
    POA_RAW8 = 0,
    #[doc = "< 16bit raw data, 1 pixel 2 bytes, value range[0, 65535]"]
    POA_RAW16 = 1,
    #[doc = "< RGB888 color data, 1 pixel 3 bytes, value range[0, 255] (only color camera)"]
    POA_RGB24 = 2,
    #[doc = "< 8bit monochrome data, convert the Bayer Filter Array to monochrome data. 1 pixel 1 byte, value range[0, 255] (only color camera)"]
    POA_MONO8 = 3,
    POA_END = -1,
}
pub use self::_POAImgFormat as POAImgFormat;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _POAErrors {
    #[doc = "< operation successful"]
    POA_OK = 0,
    #[doc = "< invalid index, means the index is < 0 or >= the count( camera or config)"]
    POA_ERROR_INVALID_INDEX = 1,
    #[doc = "< invalid camera ID"]
    POA_ERROR_INVALID_ID = 2,
    #[doc = "< invalid POAConfig"]
    POA_ERROR_INVALID_CONFIG = 3,
    #[doc = "< invalid argument(parameter)"]
    POA_ERROR_INVALID_ARGU = 4,
    #[doc = "< camera not opened"]
    POA_ERROR_NOT_OPENED = 5,
    #[doc = "< camera not found, may be removed"]
    POA_ERROR_DEVICE_NOT_FOUND = 6,
    #[doc = "< the value out of limit"]
    POA_ERROR_OUT_OF_LIMIT = 7,
    #[doc = "< camera exposure failed"]
    POA_ERROR_EXPOSURE_FAILED = 8,
    #[doc = "< timeout"]
    POA_ERROR_TIMEOUT = 9,
    #[doc = "< the data buffer size is not enough"]
    POA_ERROR_SIZE_LESS = 10,
    #[doc = "< camera is exposing. some operation, must stop exposure first"]
    POA_ERROR_EXPOSING = 11,
    #[doc = "< invalid pointer, when get some value, do not pass the NULL pointer to the function"]
    POA_ERROR_POINTER = 12,
    #[doc = "< the POAConfig is not writable"]
    POA_ERROR_CONF_CANNOT_WRITE = 13,
    #[doc = "< the POAConfig is not readable"]
    POA_ERROR_CONF_CANNOT_READ = 14,
    #[doc = "< access denied"]
    POA_ERROR_ACCESS_DENIED = 15,
    #[doc = "< operation failed, maybe the camera is disconnected suddenly"]
    POA_ERROR_OPERATION_FAILED = 16,
    #[doc = "< memory allocation failed"]
    POA_ERROR_MEMORY_FAILED = 17,
}
pub use self::_POAErrors as POAErrors;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _POACameraState {
    #[doc = "< camera was closed"]
    STATE_CLOSED = 0,
    #[doc = "< camera was opened, but not exposing"]
    STATE_OPENED = 1,
    #[doc = "< camera is exposing"]
    STATE_EXPOSING = 2,
}
pub use self::_POACameraState as POACameraState;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _POAValueType {
    #[doc = "< integer(long)"]
    VAL_INT = 0,
    #[doc = "< float(double)"]
    VAL_FLOAT = 1,
    #[doc = "< bool(POABool)"]
    VAL_BOOL = 2,
}
pub use self::_POAValueType as POAValueType;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _POAConfig {
    #[doc = "< exposure time(unit: us), read-write, valueType == VAL_INT"]
    POA_EXPOSURE = 0,
    #[doc = "< gain, read-write, valueType == VAL_INT"]
    POA_GAIN = 1,
    #[doc = "< hardware bin, read-write, valueType == VAL_BOOL"]
    POA_HARDWARE_BIN = 2,
    #[doc = "< camera temperature(uint: C), read-only, valueType == VAL_FLOAT"]
    POA_TEMPERATURE = 3,
    #[doc = "< red pixels coefficient of white balance, read-write, valueType == VAL_INT"]
    POA_WB_R = 4,
    #[doc = "< green pixels coefficient of white balance, read-write, valueType == VAL_INT"]
    POA_WB_G = 5,
    #[doc = "< blue pixels coefficient of white balance, read-write, valueType == VAL_INT"]
    POA_WB_B = 6,
    #[doc = "< camera offset, read-write, valueType == VAL_INT"]
    POA_OFFSET = 7,
    #[doc = "< maximum gain when auto-adjust, read-write, valueType == VAL_INT"]
    POA_AUTOEXPO_MAX_GAIN = 8,
    #[doc = "< maximum exposure when auto-adjust(uint: ms), read-write, valueType == VAL_INT"]
    POA_AUTOEXPO_MAX_EXPOSURE = 9,
    #[doc = "< target brightness when auto-adjust, read-write, valueType == VAL_INT"]
    POA_AUTOEXPO_BRIGHTNESS = 10,
    #[doc = "< ST4 guide north, generally,it's DEC+ on the mount, read-write, valueType == VAL_BOOL"]
    POA_GUIDE_NORTH = 11,
    #[doc = "< ST4 guide south, generally,it's DEC- on the mount, read-write, valueType == VAL_BOOL"]
    POA_GUIDE_SOUTH = 12,
    #[doc = "< ST4 guide east, generally,it's RA+ on the mount, read-write, valueType == VAL_BOOL"]
    POA_GUIDE_EAST = 13,
    #[doc = "< ST4 guide west, generally,it's RA- on the mount, read-write, valueType == VAL_BOOL"]
    POA_GUIDE_WEST = 14,
    #[doc = "< e/ADU, This value will change with gain, read-only, valueType == VAL_FLOAT"]
    POA_EGAIN = 15,
    #[doc = "< cooler power percentage[0-100%](only cool camera), read-only, valueType == VAL_INT"]
    POA_COOLER_POWER = 16,
    #[doc = "< camera target temperature(uint: C), read-write, valueType == VAL_INT"]
    POA_TARGET_TEMP = 17,
    #[doc = "< turn cooler(and fan) on or off, read-write, valueType == VAL_BOOL"]
    POA_COOLER = 18,
    #[doc = "< (deprecated)get state of lens heater(on or off), read-only, valueType == VAL_BOOL"]
    POA_HEATER = 19,
    #[doc = "< lens heater power percentage[0-100%], read-write, valueType == VAL_INT"]
    POA_HEATER_POWER = 20,
    #[doc = "< radiator fan power percentage[0-100%], read-write, valueType == VAL_INT"]
    POA_FAN_POWER = 21,
    #[doc = "< no flip, Note: set this config(POASetConfig), the 'confValue' will be ignored, read-write, valueType == VAL_BOOL"]
    POA_FLIP_NONE = 22,
    #[doc = "< flip the image horizontally, Note: set this config(POASetConfig), the 'confValue' will be ignored, read-write, valueType == VAL_BOOL"]
    POA_FLIP_HORI = 23,
    #[doc = "< flip the image vertically, Note: set this config(POASetConfig), the 'confValue' will be ignored, read-write, valueType == VAL_BOOL"]
    POA_FLIP_VERT = 24,
    #[doc = "< flip the image horizontally and vertically, Note: set this config(POASetConfig), the 'confValue' will be ignored, read-write, valueType == VAL_BOOL"]
    POA_FLIP_BOTH = 25,
    #[doc = "< Frame rate limit, the range:[0, 2000], 0 means no limit, read-write, valueType == VAL_INT"]
    POA_FRAME_LIMIT = 26,
    #[doc = "< High Quality Image, for those without DDR camera(guide camera), if set POA_TRUE, this will reduce the waviness and stripe of the image,\n< but frame rate may go down, note: this config has no effect on those cameras that with DDR. read-write, valueType == VAL_BOOL"]
    POA_HQI = 27,
    #[doc = "< USB bandwidth limit, read-write, valueType == VAL_INT"]
    POA_USB_BANDWIDTH_LIMIT = 28,
    #[doc = "< take the sum of pixels after binning, POA_TRUE is sum and POA_FLASE is average, default is POA_FLASE, read-write, valueType == VAL_BOOL"]
    POA_PIXEL_BIN_SUM = 29,
    #[doc = "< only for color camera, when set to POA_TRUE, pixel binning will use neighbour pixels and image after binning will lose the bayer pattern, read-write, valueType == VAL_BOOL"]
    POA_MONO_BIN = 30,
}
pub use self::_POAConfig as POAConfig;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _POACameraProperties {
    #[doc = "< the camera name"]
    pub cameraModelName: [::std::os::raw::c_char; 256usize],
    #[doc = "< user custom name, it will be will be added after the camera name, max len 16 bytes,like:Mars-C [Juno], default is empty"]
    pub userCustomID: [::std::os::raw::c_char; 16usize],
    #[doc = "< it's unique,camera can be controlled and set by the cameraID"]
    pub cameraID: ::std::os::raw::c_int,
    #[doc = "< max width of the camera"]
    pub maxWidth: ::std::os::raw::c_int,
    #[doc = "< max height of the camera"]
    pub maxHeight: ::std::os::raw::c_int,
    #[doc = "< ADC depth of CMOS sensor"]
    pub bitDepth: ::std::os::raw::c_int,
    #[doc = "< is a color camera or not"]
    pub isColorCamera: POABool,
    #[doc = "< does the camera have ST4 port, if not, camera don't support ST4 guide"]
    pub isHasST4Port: POABool,
    #[doc = "< does the camera have cooler assembly, generally, the cooled camera with cooler, window heater and fan"]
    pub isHasCooler: POABool,
    #[doc = "< is usb3.0 speed connection"]
    pub isUSB3Speed: POABool,
    #[doc = "< the bayer filter pattern of camera"]
    pub bayerPattern: POABayerPattern,
    #[doc = "< camera pixel size(unit: um)"]
    pub pixelSize: f64,
    #[doc = "< the serial number of camera,it's unique"]
    pub SN: [::std::os::raw::c_char; 64usize],
    #[doc = "< the sersor model(name) of camera, eg: IMX462"]
    pub sensorModelName: [::std::os::raw::c_char; 32usize],
    #[doc = "< the path of the camera in the computer host"]
    pub localPath: [::std::os::raw::c_char; 256usize],
    #[doc = "< bins supported by the camera, 1 == bin1, 2 == bin2,..., end with 0, eg:[1,2,3,4,0,0,0,0]"]
    pub bins: [::std::os::raw::c_int; 8usize],
    #[doc = "< image data format supported by the camera, end with POA_END, eg:[POA_RAW8, POA_RAW16, POA_END,...]"]
    pub imgFormats: [POAImgFormat; 8usize],
    #[doc = "< does the camera sensor support hardware bin (since V3.3.0)"]
    pub isSupportHardBin: POABool,
    #[doc = "< camera's Product ID, note: the vID of PlayerOne is 0xA0A0 (since V3.3.0)"]
    pub pID: ::std::os::raw::c_int,
    #[doc = "< reserved, the size of reserved has changed from 256 to 248 since V3.3.0"]
    pub reserved: [::std::os::raw::c_char; 248usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _POACameraProperties"][::std::mem::size_of::<_POACameraProperties>() - 992usize];
    ["Alignment of _POACameraProperties"][::std::mem::align_of::<_POACameraProperties>() - 8usize];
    ["Offset of field: _POACameraProperties::cameraModelName"]
        [::std::mem::offset_of!(_POACameraProperties, cameraModelName) - 0usize];
    ["Offset of field: _POACameraProperties::userCustomID"]
        [::std::mem::offset_of!(_POACameraProperties, userCustomID) - 256usize];
    ["Offset of field: _POACameraProperties::cameraID"]
        [::std::mem::offset_of!(_POACameraProperties, cameraID) - 272usize];
    ["Offset of field: _POACameraProperties::maxWidth"]
        [::std::mem::offset_of!(_POACameraProperties, maxWidth) - 276usize];
    ["Offset of field: _POACameraProperties::maxHeight"]
        [::std::mem::offset_of!(_POACameraProperties, maxHeight) - 280usize];
    ["Offset of field: _POACameraProperties::bitDepth"]
        [::std::mem::offset_of!(_POACameraProperties, bitDepth) - 284usize];
    ["Offset of field: _POACameraProperties::isColorCamera"]
        [::std::mem::offset_of!(_POACameraProperties, isColorCamera) - 288usize];
    ["Offset of field: _POACameraProperties::isHasST4Port"]
        [::std::mem::offset_of!(_POACameraProperties, isHasST4Port) - 292usize];
    ["Offset of field: _POACameraProperties::isHasCooler"]
        [::std::mem::offset_of!(_POACameraProperties, isHasCooler) - 296usize];
    ["Offset of field: _POACameraProperties::isUSB3Speed"]
        [::std::mem::offset_of!(_POACameraProperties, isUSB3Speed) - 300usize];
    ["Offset of field: _POACameraProperties::bayerPattern"]
        [::std::mem::offset_of!(_POACameraProperties, bayerPattern) - 304usize];
    ["Offset of field: _POACameraProperties::pixelSize"]
        [::std::mem::offset_of!(_POACameraProperties, pixelSize) - 312usize];
    ["Offset of field: _POACameraProperties::SN"]
        [::std::mem::offset_of!(_POACameraProperties, SN) - 320usize];
    ["Offset of field: _POACameraProperties::sensorModelName"]
        [::std::mem::offset_of!(_POACameraProperties, sensorModelName) - 384usize];
    ["Offset of field: _POACameraProperties::localPath"]
        [::std::mem::offset_of!(_POACameraProperties, localPath) - 416usize];
    ["Offset of field: _POACameraProperties::bins"]
        [::std::mem::offset_of!(_POACameraProperties, bins) - 672usize];
    ["Offset of field: _POACameraProperties::imgFormats"]
        [::std::mem::offset_of!(_POACameraProperties, imgFormats) - 704usize];
    ["Offset of field: _POACameraProperties::isSupportHardBin"]
        [::std::mem::offset_of!(_POACameraProperties, isSupportHardBin) - 736usize];
    ["Offset of field: _POACameraProperties::pID"]
        [::std::mem::offset_of!(_POACameraProperties, pID) - 740usize];
    ["Offset of field: _POACameraProperties::reserved"]
        [::std::mem::offset_of!(_POACameraProperties, reserved) - 744usize];
};
impl Default for _POACameraProperties {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type POACameraProperties = _POACameraProperties;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _POAConfigValue {
    #[doc = "< long"]
    pub intValue: ::std::os::raw::c_long,
    #[doc = "< double"]
    pub floatValue: f64,
    #[doc = "< POABool"]
    pub boolValue: POABool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _POAConfigValue"][::std::mem::size_of::<_POAConfigValue>() - 8usize];
    ["Alignment of _POAConfigValue"][::std::mem::align_of::<_POAConfigValue>() - 8usize];
    ["Offset of field: _POAConfigValue::intValue"]
        [::std::mem::offset_of!(_POAConfigValue, intValue) - 0usize];
    ["Offset of field: _POAConfigValue::floatValue"]
        [::std::mem::offset_of!(_POAConfigValue, floatValue) - 0usize];
    ["Offset of field: _POAConfigValue::boolValue"]
        [::std::mem::offset_of!(_POAConfigValue, boolValue) - 0usize];
};
impl Default for _POAConfigValue {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type POAConfigValue = _POAConfigValue;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _POAConfigAttributes {
    #[doc = "< is support auto?"]
    pub isSupportAuto: POABool,
    #[doc = "< is writable?"]
    pub isWritable: POABool,
    #[doc = "< is readable?"]
    pub isReadable: POABool,
    #[doc = "< config ID, eg: POA_EXPOSURE"]
    pub configID: POAConfig,
    #[doc = "< value type, eg: VAL_INT"]
    pub valueType: POAValueType,
    #[doc = "< maximum value"]
    pub maxValue: POAConfigValue,
    #[doc = "< minimum value"]
    pub minValue: POAConfigValue,
    #[doc = "< default value"]
    pub defaultValue: POAConfigValue,
    #[doc = "< POAConfig name, eg: POA_EXPOSURE: \"Exposure\", POA_TARGET_TEMP: \"TargetTemp\""]
    pub szConfName: [::std::os::raw::c_char; 64usize],
    #[doc = "< a brief introduction about this one POAConfig"]
    pub szDescription: [::std::os::raw::c_char; 128usize],
    #[doc = "< reserved"]
    pub reserved: [::std::os::raw::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _POAConfigAttributes"][::std::mem::size_of::<_POAConfigAttributes>() - 304usize];
    ["Alignment of _POAConfigAttributes"][::std::mem::align_of::<_POAConfigAttributes>() - 8usize];
    ["Offset of field: _POAConfigAttributes::isSupportAuto"]
        [::std::mem::offset_of!(_POAConfigAttributes, isSupportAuto) - 0usize];
    ["Offset of field: _POAConfigAttributes::isWritable"]
        [::std::mem::offset_of!(_POAConfigAttributes, isWritable) - 4usize];
    ["Offset of field: _POAConfigAttributes::isReadable"]
        [::std::mem::offset_of!(_POAConfigAttributes, isReadable) - 8usize];
    ["Offset of field: _POAConfigAttributes::configID"]
        [::std::mem::offset_of!(_POAConfigAttributes, configID) - 12usize];
    ["Offset of field: _POAConfigAttributes::valueType"]
        [::std::mem::offset_of!(_POAConfigAttributes, valueType) - 16usize];
    ["Offset of field: _POAConfigAttributes::maxValue"]
        [::std::mem::offset_of!(_POAConfigAttributes, maxValue) - 24usize];
    ["Offset of field: _POAConfigAttributes::minValue"]
        [::std::mem::offset_of!(_POAConfigAttributes, minValue) - 32usize];
    ["Offset of field: _POAConfigAttributes::defaultValue"]
        [::std::mem::offset_of!(_POAConfigAttributes, defaultValue) - 40usize];
    ["Offset of field: _POAConfigAttributes::szConfName"]
        [::std::mem::offset_of!(_POAConfigAttributes, szConfName) - 48usize];
    ["Offset of field: _POAConfigAttributes::szDescription"]
        [::std::mem::offset_of!(_POAConfigAttributes, szDescription) - 112usize];
    ["Offset of field: _POAConfigAttributes::reserved"]
        [::std::mem::offset_of!(_POAConfigAttributes, reserved) - 240usize];
};
impl Default for _POAConfigAttributes {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type POAConfigAttributes = _POAConfigAttributes;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _POASensorModeInfo {
    #[doc = "< sensor mode name, can be used to display on the UI (eg: Combobox)"]
    pub name: [::std::os::raw::c_char; 64usize],
    #[doc = "< sensor mode description, may be useful for tooltip"]
    pub desc: [::std::os::raw::c_char; 128usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _POASensorModeInfo"][::std::mem::size_of::<_POASensorModeInfo>() - 192usize];
    ["Alignment of _POASensorModeInfo"][::std::mem::align_of::<_POASensorModeInfo>() - 1usize];
    ["Offset of field: _POASensorModeInfo::name"]
        [::std::mem::offset_of!(_POASensorModeInfo, name) - 0usize];
    ["Offset of field: _POASensorModeInfo::desc"]
        [::std::mem::offset_of!(_POASensorModeInfo, desc) - 64usize];
};
impl Default for _POASensorModeInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type POASensorModeInfo = _POASensorModeInfo;
